tap "acsandmann/tap"
tap "assimelha/tap"
tap "barutsrb/tap"
tap "dimentium/autoraise"
tap "dopplerhq/cli"
tap "felixkratz/formulae"
tap "kristoferlund/ostt"
tap "nikitabobko/tap"
tap "obra/tap"
tap "oven-sh/bun"
tap "sst/tap"
tap "steveyegge/beads"
tap "strongdm/tap"
tap "zippoxer/tap"
brew "asciinema"
brew "ast-grep"
brew "azure-cli"
brew "bat"
brew "cmake"
brew "composer"
brew "container", link: false
brew "croc"
brew "direnv"
brew "eza"
brew "fd"
brew "ffmpeg"
brew "fzf"
brew "node"
brew "gemini-cli"
brew "gh"
brew "git"
brew "git-absorb"
brew "glow"
brew "gnupg"
brew "gopls"
brew "graphviz"
brew "handbrake"
brew "harper"
brew "helix"
brew "ipcalc"
brew "jj"
brew "just"
brew "lazydocker"
brew "lazygit"
brew "lefthook"
brew "llm"
brew "lua-language-server"
brew "luarocks"
brew "mas"
brew "mise"
brew "mole"
brew "mosh"
brew "neovim"
brew "ripgrep"
brew "opencode"
brew "pandoc"
brew "pass"
brew "pnpm"
brew "pre-commit"
brew "pyright"
brew "python@3.12"
brew "rust-analyzer"
brew "starship"
brew "stow"
brew "superfile"
brew "terminal-notifier"
brew "tmux"
brew "typescript-language-server"
brew "typos-cli"
brew "typst"
brew "unar"
brew "uv"
brew "wget"
brew "yadm"
brew "yarn"
brew "yazi"
brew "yt-dlp"
brew "zellij"
brew "zoxide"
brew "zsh-autocomplete"
brew "zsh-autopair"
brew "zsh-autosuggestions"
brew "zsh-history-substring-search"
brew "zsh-syntax-highlighting"
brew "acsandmann/tap/rift"
brew "assimelha/tap/bdui"
brew "dopplerhq/cli/doppler"
brew "felixkratz/formulae/borders"
brew "kristoferlund/ostt/ostt"
brew "obra/tap/packnplay"
brew "oven-sh/bun/bun"
brew "steveyegge/beads/bd"
brew "zippoxer/tap/recall"
cask "1password-cli", args: { appdir: "/Applications" }
cask "alacritty", args: { appdir: "/Applications" }
cask "arc"
cask "chromium"
cask "claude", args: { appdir: "/Applications" }
cask "claude-code"
cask "codex"
cask "container"
cask "cursor"
cask "discord", args: { appdir: "/Applications" }
cask "font-blex-mono-nerd-font", args: { appdir: "~/Applications" }
cask "font-ia-writer-mono"
cask "font-symbols-only-nerd-font", args: { appdir: "~/Applications" }
cask "ghostty", args: { appdir: "/Applications" }
cask "hyprspace"
cask "iterm2", args: { appdir: "/Applications" }
cask "karabiner-elements", args: { appdir: "/Applications" }
cask "kicad"
cask "leader-key", args: { appdir: "/Applications" }
cask "leash-app"
cask "linear-linear"
cask "localsend", args: { appdir: "~/Applications" }
cask "macwhisper", args: { appdir: "/Applications" }
cask "microsoft-auto-update"
cask "microsoft-excel", args: { appdir: "~/Applications" }
cask "microsoft-outlook", args: { appdir: "~/Applications" }
cask "microsoft-teams", args: { appdir: "~/Applications" }
cask "microsoft-word", args: { appdir: "~/Applications" }
cask "notunes"
cask "obsidian", args: { appdir: "/Applications" }
cask "omniwm"
cask "orbstack", args: { appdir: "/Applications" }
cask "pearcleaner", args: { appdir: "/Applications" }
cask "powershell"
cask "raycast", args: { appdir: "/Applications" }
cask "shottr"
cask "syntax-highlight", args: { appdir: "/Applications" }
cask "telegram", args: { appdir: "/Applications" }
cask "visual-studio-code", args: { appdir: "/Applications" }
cask "vlc", args: { appdir: "/Applications" }
cask "voiceink", args: { appdir: "/Applications" }
cask "warp"
cask "wezterm"
cask "whatsapp"
cask "zoom", args: { appdir: "/Applications" }
vscode "aaron-bond.better-comments"
vscode "anthropic.claude-code"
vscode "arcticicestudio.nord-visual-studio-code"
vscode "asmraihan.vivid-black"
vscode "asvetliakov.vscode-neovim"
vscode "be5invis.vscode-custom-css"
vscode "bjarne.hackerman-omarchy"
vscode "block.vscode-goose"
vscode "catppuccin.catppuccin-vsc"
vscode "catppuccin.catppuccin-vsc-icons"
vscode "charliermarsh.ruff"
vscode "christian-kohler.path-intellisense"
vscode "codezombiech.gitignore"
vscode "davidanson.vscode-markdownlint"
vscode "davidmorais.dark-magic-themes"
vscode "daylerees.rainglow"
vscode "dbaeumer.vscode-eslint"
vscode "donjayamanne.githistory"
vscode "dorianmassoulier.repomix-runner"
vscode "dustypomerleau.rust-syntax"
vscode "enkia.tokyo-night"
vscode "esbenp.prettier-vscode"
vscode "fabiospampinato.vscode-monokai-night"
vscode "fill-labs.dependi"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.code-runner"
vscode "github.codespaces"
vscode "github.github-vscode-theme"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "google.geminicodeassist"
vscode "gruntfuggly.todo-tree"
vscode "jacobdufault.fuzzy-search"
vscode "jamiewoodio.cisco"
vscode "jasew.vscode-helix-emulation"
vscode "lakshits11.best-themes-redefined"
vscode "lakshits11.monokai-pirokai"
vscode "mattpocock.ts-error-translator"
vscode "miguelsolorio.fluent-icons"
vscode "miguelsolorio.symbols"
vscode "ms-azuretools.vscode-azureresourcegroups"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.pylint"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.theme-predawnkit"
vscode "ms-windows-ai-studio.windows-ai-studio"
vscode "mvllow.rose-pine"
vscode "p-yukusai.black-iris"
vscode "philxor.iosxr"
vscode "pkief.material-icon-theme"
vscode "qufiwefefwoyn.kanagawa"
vscode "raunofreiberg.vesper"
vscode "rust-lang.rust-analyzer"
vscode "sainnhe.everforest"
vscode "shadesofbuntu.flexoki-dark"
vscode "subframe7536.custom-ui-style"
vscode "tahayvr.matteblack"
vscode "tamasfe.even-better-toml"
vscode "teamsdevapp.vscode-ai-foundry"
vscode "thang-nm.catppuccin-perfect-icons"
vscode "tinkertrain.theme-panda"
vscode "usernamehw.errorlens"
vscode "vadimcn.vscode-lldb"
vscode "vscodevim.vim"
vscode "vspacecode.whichkey"
vscode "wallabyjs.console-ninja"
vscode "y-ysss.cisco-config-highlight"
vscode "yzhang.markdown-all-in-one"
vscode "zhuangtongfa.material-theme"
go "cmd/go"
go "cmd/gofmt"
cargo "cargo-audit"
cargo "deciduous"
cargo "needle-cli"
cargo "trippy"
