# ABOUTME: macOS-specific Homebrew packages
# ABOUTME: Casks, Mac App Store apps, and macOS-only tools

# Global cask options
cask_args appdir: "/Applications"

# macOS-specific taps
tap "acsandmann/tap"
tap "assimelha/tap"
tap "barutsrb/tap"
tap "dimentium/autoraise"
tap "felixkratz/formulae"
tap "kristoferlund/ostt"
tap "nikitabobko/tap"
tap "strongdm/tap"
tap "zippoxer/tap"

# macOS-specific formulae
brew "azure-cli"
brew "mole"
brew "composer"
brew "container", link: false
brew "gemini-cli"
brew "handbrake"
brew "harper"
brew "mas"
brew "terminal-notifier"

# ZSH plugins (macOS uses zsh)
brew "zsh-autocomplete"
brew "zsh-autopair"
brew "zsh-autosuggestions"
brew "zsh-history-substring-search"
brew "zsh-syntax-highlighting"

# macOS-specific tap formulae
brew "acsandmann/tap/rift"
brew "assimelha/tap/bdui"
brew "felixkratz/formulae/borders"
brew "kristoferlund/ostt/ostt"
brew "zippoxer/tap/recall"

# Casks (macOS GUI applications)
cask "1password"
cask "1password-cli"
cask "claude"
cask "claude-code"
cask "codex"
cask "container"
cask "cursor"
cask "devpod"
cask "discord"
cask "ghostty"
cask "hyprspace"
cask "iterm2"
cask "karabiner-elements"
cask "keymapp"
cask "kicad"
cask "kitlangton-hex"
cask "leader-key"
cask "leash-app"
cask "linear-linear"
cask "localsend"
cask "macwhisper"
cask "microsoft-auto-update"
cask "microsoft-excel"
cask "microsoft-outlook"
cask "microsoft-teams"
cask "microsoft-word"
cask "notunes"
cask "obsidian"
cask "omniwm"
cask "orbstack"
cask "pearcleaner"
cask "raycast"
cask "shottr"
cask "spotify"
cask "telegram"
cask "visual-studio-code"
cask "vlc"
cask "voiceink"
cask "warp"
cask "wezterm"
cask "whatsapp"
cask "zed"
cask "zoom"

# Fonts
cask "font-blex-mono-nerd-font"
cask "font-ia-writer-mono"
cask "font-symbols-only-nerd-font"

# VSCode extensions (managed by Homebrew on macOS)
vscode "aaron-bond.better-comments"
vscode "anthropic.claude-code"
vscode "arcticicestudio.nord-visual-studio-code"
vscode "asmraihan.vivid-black"
vscode "asvetliakov.vscode-neovim"
vscode "be5invis.vscode-custom-css"
vscode "bjarne.hackerman-omarchy"
vscode "block.vscode-goose"
vscode "catppuccin.catppuccin-vsc"
vscode "catppuccin.catppuccin-vsc-icons"
vscode "charliermarsh.ruff"
vscode "christian-kohler.path-intellisense"
vscode "codezombiech.gitignore"
vscode "davidanson.vscode-markdownlint"
vscode "davidmorais.dark-magic-themes"
vscode "daylerees.rainglow"
vscode "dbaeumer.vscode-eslint"
vscode "donjayamanne.githistory"
vscode "dorianmassoulier.repomix-runner"
vscode "dustypomerleau.rust-syntax"
vscode "enkia.tokyo-night"
vscode "esbenp.prettier-vscode"
vscode "fabiospampinato.vscode-monokai-night"
vscode "fill-labs.dependi"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.code-runner"
vscode "github.codespaces"
vscode "github.github-vscode-theme"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "google.geminicodeassist"
vscode "gruntfuggly.todo-tree"
vscode "jacobdufault.fuzzy-search"
vscode "jamiewoodio.cisco"
vscode "jasew.vscode-helix-emulation"
vscode "lakshits11.best-themes-redefined"
vscode "lakshits11.monokai-pirokai"
vscode "mattpocock.ts-error-translator"
vscode "miguelsolorio.fluent-icons"
vscode "miguelsolorio.symbols"
vscode "ms-azuretools.vscode-azureresourcegroups"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.pylint"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.theme-predawnkit"
vscode "ms-windows-ai-studio.windows-ai-studio"
vscode "mvllow.rose-pine"
vscode "p-yukusai.black-iris"
vscode "philxor.iosxr"
vscode "pkief.material-icon-theme"
vscode "qufiwefefwoyn.kanagawa"
vscode "raunofreiberg.vesper"
vscode "rust-lang.rust-analyzer"
vscode "sainnhe.everforest"
vscode "shadesofbuntu.flexoki-dark"
vscode "subframe7536.custom-ui-style"
vscode "tahayvr.matteblack"
vscode "tamasfe.even-better-toml"
vscode "teamsdevapp.vscode-ai-foundry"
vscode "thang-nm.catppuccin-perfect-icons"
vscode "tinkertrain.theme-panda"
vscode "usernamehw.errorlens"
vscode "vadimcn.vscode-lldb"
vscode "vscodevim.vim"
vscode "vspacecode.whichkey"
vscode "wallabyjs.console-ninja"
vscode "y-ysss.cisco-config-highlight"
vscode "yzhang.markdown-all-in-one"
vscode "zhuangtongfa.material-theme"

# Mac App Store
mas "1Password for Safari", id: 1569813296
mas "Simplenote", id: 692867256
mas "Tailscale", id: 1475387142
mas "Xcode", id: 497799835
mas "obsidian-web-clipper", id: 6720708363
mas "pl2303-serial", id: 1624835354
mas "raycast-companion", id: 6738274497
mas "zsa-keymapp", id: 6472865291
